Repository: osaurus-ai/osaurus
Catalog: Packages/OsaurusCore/Resources/Localizable.xcstrings
Source language: en
Languages: ko, ru, zh_hans, zh_hant

source: No actions defined yet. Add one below — agents can only call actions that are defined here.
zh_hans: 尚未定义操作。在下方添加一个 — 智能体只能调用此处定义的操作。
zh_hant: 尚未定義操作。在下方新增一個 — 智慧體只能調用此處定義的操作。

source: No agent assigned
zh_hans: 未分配智能体
zh_hant: 未分配智慧體

source: No app allowlist is active.
zh_hans: 当前未启用应用允许列表。
zh_hant: 目前未啟用應用程式允許清單。

source: No channels are marked Write yet. Mark them in the Access section or add IDs under its Advanced options.
zh_hans: 尚未标记任何频道为写入。在访问部分标记它们或在其高级选项下添加 ID。
zh_hant: 尚未標記任何頻道爲寫入。在訪問部分標記它們或在其進階選項下新增 ID。

source: No custom tools yet
zh_hans: 暂无自定义工具
zh_hant: 暫無自訂工具

source: No database changes were recorded for this run.
zh_hans: 此次运行未记录任何数据库更改。
zh_hant: 此次運行未誌錄任何資料庫更改。

source: No diff available for this change.
zh_hans: 此更改没有可用的差异。
zh_hant: 此更改沒有可用的差異。

source: No Discord message arrived within 90 seconds.
zh_hans: 90 秒内没有收到 Discord 消息。
zh_hant: 90 秒內沒有收到 Discord 訊息。

source: no dispatch
zh_hans: 无分发
zh_hant: 無分發

source: No enabled source can search this category.
zh_hans: 没有已启用的来源可以搜索此类别。
zh_hant: 沒有已啟用的來源可以搜尋此類別。

source: No forced-confirm app match for this preview.
zh_hans: 本次预览未匹配到需强制确认的应用。
zh_hant: 本次預覽未比對到需強制確認的應用程式。

source: No image models yet
zh_hans: 尚无图片模型
zh_hant: 尚無圖片模型

source: No incoming Discord messages yet this session. Send the test message and press “Verify incoming message”.
zh_hans: 本次会话尚未收到 Discord 消息。发送测试消息并按“验证传入消息”。
zh_hant: 本次會話尚未收到 Discord 訊息。傳送測試訊息並按“驗證傳入訊息”。

source: No incoming Slack events yet this session. Send the test message and press “Verify incoming message”.
zh_hans: 本次会话尚未收到 Slack 事件。发送测试消息并按“验证传入消息”。
zh_hant: 本次會話尚未收到 Slack 事件。傳送測試訊息並按“驗證傳入訊息”。

source: No incoming Telegram messages yet this session. Send the bot a message and press “Verify incoming message”.
zh_hans: 本次会话尚未收到 Telegram 消息。向机器人发送消息并按“验证传入消息”。
zh_hant: 本次會話尚未收到 Telegram 訊息。向機器人傳送訊息並按“驗證傳入訊息”。

source: No live tool-call proof is recorded for this exact bundle yet.
zh_hans: 此特定捆绑包尚未记录实时工具调用证明。
zh_hant: 此特定包尚未記錄實時工具調用驗證。

source: No local ledger rows
zh_hans: 本地账本中无记录
zh_hant: 本地賬本裡沒有記錄

source: No local models installed yet. Download models from the Models manager and they will be exposed here automatically.
zh_hans: 尚未安装本地模型。从模型管理器下载模型后，它们将自动在这里显示。
zh_hant: 尚未安裝任何本地模型。從模型管理員下載模型後，它們將會自動在此處顯示。

source: No local models match your search.
zh_hans: 没有符合搜索条件的本地模型。
zh_hant: 沒有符合搜尋條件的本地模型。

source: No matching channels
zh_hans: 没有匹配的频道
zh_hant: 沒有匹配的頻道

source: No matching people
zh_hans: 没有匹配的人员
zh_hant: 沒有匹配的人員

source: No matching per-app override for the preview app.
zh_hans: 预览应用没有匹配的按应用覆盖规则。
zh_hant: 預覽的應用程式沒有相符的個別應用程式覆寫規則。

source: No matching Slack channels
zh_hans: 没有匹配的 Slack 频道
zh_hant: 沒有匹配的 Slack 頻道

source: No matching Slack users
zh_hans: 没有匹配的 Slack 用户
zh_hant: 沒有匹配的 Slack 使用者

source: No messages yet
zh_hans: 暂无消息
zh_hant: 暫無訊息

source: No models match your search.
zh_hans: 没有符合搜索条件的模型。
zh_hant: 沒有符合搜尋條件的模型。

source: No outstanding file changes
zh_hans: 没有待处理的文件更改
zh_hant: 沒有未完成檔案更改

source: No pinned views yet. Pin a saved view from the Saved Views section to see it here at a glance.
zh_hans: 暂无固定视图。从保存的视图部分固定一个视图，即可在此一览。
zh_hant: 暫無固定視圖。從儲存的視圖部分固定一個視圖，即可在此一覽。

source: No plugin skills installed — plugins can bundle skills when you install them
zh_hans: 未安装插件技能 — 插件在安装时可以捆绑技能
zh_hant: 未安裝插件技能 — 插件在安裝時可以捆綁技能

source: No preview ceiling is applied.
zh_hans: 未应用预览上限。
zh_hant: 未套用預覽上限。

source: No receive audit events have been recorded for this scope.
zh_hans: 此范围尚未记录任何接收审计事件。
zh_hant: 此範圍尚未記錄任何接收審計事件。

source: No receive decisions yet
zh_hans: 暂无接收决策
zh_hant: 尚未收到決定

source: No remote providers connected. Models from Osaurus Router and your own providers appear here once connected.
zh_hans: 未连接远程提供商。连接后，Osaurus 路由器和你自己的提供商模型将显示在这里。
zh_hant: 尚未連接遠端提供者。當您在連接後，Osaurus Router 和您自己的提供者模型將會出現在這裡。

source: No results. Try a different query.
zh_hans: 无结果。请尝试其他查询。
zh_hant: 無結果。請嘗試其他查詢。

source: No routing rule claimed this message and no default agent is set. Add a route for this room or pick a default agent in the channel settings.
zh_hans: 没有路由规则认领此消息，且未设置默认智能体。为此房间添加路由规则或在频道设置中选择默认智能体。
zh_hant: 沒有路由規則認領此訊息，且未設定預設智慧體。爲此房間新增路由規則或在頻道設定中選擇預設智慧體。

source: No rows in `%@` yet.
zh_hans: `%@` 中暂无行。
zh_hant: `%@` 中暫無行。

source: No runs yet. When the agent works on a schedule or automation, each run shows up here.
zh_hans: 暂无运行记录。当智能体按计划或自动运行时，每次运行都会显示在此处。
zh_hant: 暫無運行誌錄。當代理按計劃或自動運行時，每次運行都會顯示在此處。

source: No saved views yet. Ask the agent in chat to create one — it uses the `db_define_view` tool.
zh_hans: 暂无保存的视图。在聊天中让智能体创建一个 — 它使用 `db_define_view` 工具。
zh_hant: 暫無儲存的視圖。在聊天中讓智能體建立一個 — 它使用 `db_define_view` 工具。

source: No sessions yet. A session appears here the first time an agent uses the browser.
zh_hans: 尚无会话。会话在智能体首次使用浏览器时出现在此处。
zh_hant: 尚無會話。會話在智能體首次使用瀏覽器時出現在此處。

source: No signed checks yet
zh_hans: 暂无已签名的检查
zh_hant: 尚無簽名檢查

source: No skills of your own yet — create or import one
zh_hans: 暂无自定义技能 — 创建或导入一个
zh_hant: 暫無自訂技能 — 建立或匯入一個

source: No Slack event arrived within 90 seconds.
zh_hans: 90 秒内没有收到 Slack 事件。
zh_hant: 90 秒內沒有收到 Slack 事件。

source: No speech detected
zh_hans: 未检测到语音
zh_hant: 未檢測到語音

source: No Speech Detected
zh_hans: 未检测到语音
zh_hant: 未檢測到語音

source: No stored message snapshots have been recorded for this scope.
zh_hans: 此范围尚未记录任何存储的消息快照。
zh_hant: 此範圍尚未記錄任何存儲的消息快照。

source: No Telegram message arrived within 90 seconds.
zh_hans: 90 秒内没有收到 Telegram 消息。
zh_hant: 90 秒內沒有收到 Telegram 訊息。

source: No tools assigned yet
zh_hans: 尚未分配工具
zh_hant: 尚未分配工具

source: No tools defined in this custom tool
zh_hans: 此自定义工具中未定义工具
zh_hant: 此自訂工具中未定義工具

source: No tools match “%@”
zh_hans: 没有工具匹配“%@”
zh_hant: 沒有工具匹配“%@”

source: No tools match the current filters
zh_hans: 没有工具匹配当前筛选条件
zh_hant: 沒有工具符合目前的篩選條件

source: No tools yet
zh_hans: 暂无工具
zh_hant: 暫無工具

source: No usage activity
zh_hans: 无使用活动
zh_hant: 無使用活動

source: No webhook is registered for this bot. Long polling is safe to enable.
zh_hans: 此机器人未注册 webhook。启用长轮询是安全的。
zh_hant: 此機器人未註冊 webhook。啟用長輪詢是安全的。

source: None (only routed rooms answer)
zh_hans: 无（仅路由房间响应）
zh_hant: 無（僅路由房間回應）

source: Not a standard action
zh_hans: 不是标准操作
zh_hant: 不是標準操作

source: Not configured
zh_hans: 未配置
zh_hant: 未設定

source: Not reached
zh_hans: 未触及
zh_hant: 未觸及

source: Not running
zh_hans: 未运行
zh_hant: 未執行

source: Not saved
zh_hans: 未保存
zh_hant: 未儲存

source: Not sent to an agent
zh_hans: 未发送到智能体
zh_hant: 未傳送到智慧體

source: Not used by Socket Mode receive
zh_hans: 不用于 Socket Mode 接收
zh_hant: 不用於 Socket Mode 接收

source: Not yet granted
zh_hans: 尚未授予
zh_hant: 尚未授予

source: Note
zh_hans: 说明
zh_hant: 說明

source: Note: this agent uses a remote model, so its schema (table names and column types) is sent with each request. Row data is not.
zh_hans: 注意：此智能体使用远程模型，因此其模式（表名和列类型）会随每次请求发送。行数据不会发送。
zh_hant: 注意：此智能體使用遠程模型，因此其模式（表名和列類型）會隨每次請求傳送。行數據不會傳送。

source: Nothing was inserted.
zh_hans: 未插入任何内容。
zh_hant: 沒有插入任何內容。

source: Nothing was sent.
zh_hans: 未发送任何内容。
zh_hant: 沒有發送任何內容。

source: Numeric server IDs Osaurus may inspect. At least one is required.
zh_hans: Osaurus 可以检查的数值型服务器 ID。至少需要一个。
zh_hant: Osaurus 可以檢查的數值型伺服器 ID。至少需要一個。

source: Observe
zh_hans: 观察
zh_hant: 觀察

# of the model's ~%@ token window (%@)
source: of the model's ~%1$@ token window (%2$@)
zh_hans: 占模型约 %1$@ Token 窗口的 %2$@
zh_hant: 佔模型約 %1$@@ token 窗口的 %2$@

source: Off — searches use the providers and built-in sources below.
zh_hans: 关闭 — 搜索使用下方的提供商和内置源。
zh_hant: 關閉 — 搜尋使用下方的提供者和內置源。

source: Off — your own providers below handle every search.
zh_hans: 关闭 — 你自己的提供商处理所有搜索。
zh_hant: 關閉 — 你自己的提供商處理所有搜尋。

source: Off (recommended): mask ALL on-screen text before sending. On: send a screenshot where only detected sensitive text (names, emails, numbers, secrets) is masked — other text stays readable to the model.
zh_hans: 关闭（推荐）：发送前遮蔽所有屏幕文本。开启：发送截图，其中仅检测到的敏感文本（姓名、邮箱、数字、密钥）被遮蔽 — 其余文本对模型保持可读。
zh_hant: 關閉（建議）：發送前遮蔽所有螢幕文字。開啟：發送螢幕截圖，其中僅檢測到的敏感文字（姓名、電子郵件、數字、金鑰）被遮蔽 — 其餘文字對模型保持可讀。

source: Off means premium search stops at your remaining credits; everything else uses the built-in sources.
zh_hans: 关闭意味着高级搜索在剩余积分用完后停止；其他所有搜索使用内置源。
zh_hant: 關閉意味着進階搜尋在剩餘積分用完後停止；其他所有搜尋使用內置源。

source: Official
zh_hans: 官方
zh_hant: 官方

source: Official Google API. Needs two values — about 5 minutes to set up.
zh_hans: 官方 Google API。需要两个值 — 约 5 分钟即可设置完成。
zh_hant: 官方 Google API。需要兩個值 — 約 5 分鐘即可設定完成。

source: On the same Bot page, press “Reset Token” and copy the token it shows.
zh_hans: 在同一个机器人页面上，按“重置令牌”并复制其显示的令牌。
zh_hant: 在同一個機器人頁面上，按“重置令牌”並複製其顯示的令牌。

source: On-Device (PocketTTS)
zh_hans: 设备端（PocketTTS）
zh_hant: 裝置端（PocketTTS）

source: One browser profile per agent. Open a session to see it live (or restore it at its last page). Sign-in badges reflect what Osaurus has actually observed — never guessed from cookies.
zh_hans: 每个智能体一个浏览器配置文件。打开会话以实时查看（或在其最后页面恢复）。登录状态标记反映 Osaurus 实际观察到的内容 — 绝非从 Cookie 猜测。
zh_hant: 每個智能體一個瀏覽器設定檔。開啟會話以即時查看（或在其最後頁面恢復）。登入狀態標記反映 Osaurus 實際觀察到的內容 — 絕非從 Cookie 猜測。

source: One per line: Header-Name: value. Use ${secret:name} for tokens.
zh_hans: 每行一个：Header-Name: value。使用 ${secret:name} 作为令牌。
zh_hant: 每行一個：Header-Name: value。使用 ${secret:name} 作爲令牌。

source: One per line: name=keychain-id. Raw tokens are not stored in this JSON file.
zh_hans: 每行一个：name=keychain-id。原始令牌不存储在此 JSON 文件中。
zh_hant: 每行一個：name=keychain-id。原始令牌不儲存在此 JSON 檔案中。

source: Only checked standard actions are offered to agents on this channel.
zh_hans: 只有选中的标准操作才会提供给此频道的智能体。
zh_hant: 只有選中的標準操作纔會提供給此頻道的智慧體。

source: Only selected people may trigger inbound handling. An empty sender list keeps Slack receive disabled.
zh_hans: 只有选定的人员才能触发入站处理。发送者列表为空时，Slack 接收将保持禁用。
zh_hant: 只有選定的人員才能觸發傳入處理。空的傳送者列表會保持 Slack 接收停用。

source: Only these Slack users can trigger inbound handling.
zh_hans: 只有这些 Slack 用户可以触发入站处理。
zh_hant: 只有這些 Slack 使用者可以觸發入站處理。

source: Only these Telegram users can trigger inbound handling; required for receive.
zh_hans: 只有这些 Telegram 用户可以触发入站处理；接收必需。
zh_hant: 只有這些 Telegram 使用者可以觸發入站處理；接收必需。

source: Only used when every other source fails — this source sometimes returns unreliable results.
zh_hans: 仅在所有其他来源都失败时使用 — 该来源有时返回不可靠的结果。
zh_hant: 僅在所有其他來源都失敗時使用 — 該來源有時返回不可靠的結果。

source: Only used when every other source fails.
zh_hans: 仅在所有其他来源都失败时使用。
zh_hant: 僅在所有其他來源都失敗時使用。

source: Open @BotFather in Telegram
zh_hans: 在 Telegram 中打开 @BotFather
zh_hant: 在 Telegram 中開啟 @BotFather

source: Open %@ Settings
zh_hans: 打开 %@ 设置
zh_hant: 開啟 %@ 設定

source: Open api.slack.com/apps and choose “Create New App” → “From a manifest”
zh_hans: 打开 api.slack.com/apps 并选择“创建新应用” → “从清单”
zh_hant: 開啟 api.slack.com/apps 並選擇“建立新應用程式” → “從設定檔”

source: Open app
zh_hans: 打开应用
zh_hant: 開啟應用程式

source: Open Browser settings
zh_hans: 打开浏览器设置
zh_hant: 開啟瀏覽器設定

source: Open configuration file
zh_hans: 打开配置文件
zh_hant: 開啟設定檔

source: Open Database
zh_hans: 打开数据库
zh_hant: 開啟資料庫

source: Open file
zh_hans: 打开文件
zh_hant: 開啟檔案

source: Open Images
zh_hans: 打开图像
zh_hant: 打開圖像

source: Open Saved Views
zh_hans: 打开保存的视图
zh_hant: 開啟儲存的視圖

source: Open Search settings
zh_hans: 打开搜索设置
zh_hant: 開啟搜尋設定

source: Open Search Settings
zh_hans: 打开搜索设置
zh_hant: 開啟搜尋設定

source: Open signup page
zh_hans: 打开注册页面
zh_hant: 開啟註冊頁面

source: Open System Settings
zh_hans: 打开系统设置
zh_hant: 開啟系統設定

source: Open System Settings to grant permissions
zh_hans: 打开系统设置以授予权限
zh_hant: 開啟系統設定以授予權限

source: Open the Discord Developer Portal and choose “New Application”
zh_hans: 打开 Discord 开发者门户并选择“新应用”
zh_hant: 開啟 Discord 開發者入口網站並選擇“新應用程式”

source: Open this session in a window
zh_hans: 在窗口中打开此会话
zh_hant: 在視窗中開啟此會話

source: Open this URL in a browser and pick your server.
zh_hans: 在浏览器中打开此 URL 并选择你的服务器。
zh_hant: 在瀏覽器中開啟此 URL 並選擇您的伺服器。

source: Open your Slack app settings
zh_hans: 打开你的 Slack 应用设置
zh_hant: 開啟您的 Slack 應用程式設定

source: Ops Webhook
zh_hans: 运维 Webhook
zh_hant: 維運 Webhook

source: Optional — enables Socket Mode receive
zh_hans: 可选 — 启用 Socket Mode 接收
zh_hant: 可選 — 啟用 Socket Mode 接收

source: Optional — webhook receive
zh_hans: 可选 — webhook 接收
zh_hant: 可選 — webhook 接收

source: Optional hot tier held in GPU memory. SSD cache can still restore prefixes across requests when this is off.
zh_hans: 可选的热层存储在 GPU 内存中。关闭此项后 SSD 缓存仍可在请求间恢复前缀。
zh_hant: 可選的熱層儲存在 GPU 記憶體中。關閉此項後 SSD 快取仍可在請求間恢復前綴。

source: Optional names, comma-separated (e.g. sales, support)
zh_hans: 可选名称，逗号分隔（例如 sales、support）
zh_hant: 選用名稱，逗號分隔（例如 sales、support）

source: Optional per-response output cap for the default agent. Leave blank to inherit the active model bundle's generation_config maximum. This is not the model context window or KV retention.
zh_hans: 默认智能体每次回复的输出上限，可留空；留空时将沿用当前模型包 generation_config 中的最大值。此项既不是模型上下文窗口，也不是 KV 保留量。
zh_hant: 預設智能體每次回覆的輸出上限，可留空；留空時將沿用目前模型套件 generation_config 中的最大值。此項既不是模型脈絡視窗，也不是 KV 保留量。

source: Optional rationale or surrounding context
zh_hans: 可选的理由或上下文
zh_hant: 選填的理由或脈絡

source: Optional: add routing rules to answer different %1$@s with different agents, or let a name prefix pick an agent inside a shared %2$@.
zh_hans: 可选：添加路由规则以用不同的智能体回答不同的 %@，或让名称前缀在共享 %@ 内选择智能体。
zh_hant: 選用：新增路由規則以用不同的智慧體回答不同的 %@，或讓名稱前綴在共享 %@ 內選擇智慧體。

source: Optional. Leave empty to allow only the bot token's own workspace.
zh_hans: 可选。留空则仅允许机器人令牌自身的工作区。
zh_hant: 可選。留空則僅允許機器人令牌自身的工作區。

source: Optionally pick a different model for the browsing subagent.
zh_hans: 可选地为浏览子智能体选择不同的模型。
zh_hant: 可選地為瀏覽子智能體選擇不同的模型。

source: Original
zh_hans: 原始
zh_hant: 原始

source: Osaurus connects out to Slack over Socket Mode — no webhook, public URL, or Request URL is needed.
zh_hans: Osaurus 通过 Socket Mode 连接到 Slack — 不需要 webhook、公共 URL 或请求 URL。
zh_hant: Osaurus 通過 Socket Mode 連線到 Slack — 不需要 webhook、公共 URL 或請求 URL。

source: Osaurus continuously asks Telegram for new messages while the app runs (long polling). Turn this off only if another program polls the same bot.
zh_hans: Osaurus 在应用运行时持续向 Telegram 请求新消息（长轮询）。仅在另一个程序轮询同一机器人时才关闭此功能。
zh_hant: Osaurus 在應用程式運行時持續向 Telegram 請求新訊息（長輪詢）。僅在另一個程序輪詢同一機器人時才關閉此功能。

source: Osaurus dinosaur and the Product Hunt kitty saying thank you
zh_hans: Osaurus 恐龙和 Product Hunt 小猫在说谢谢
zh_hant: Osaurus 恐龍和 Product Hunt 小貓在說謝謝

source: Osaurus has not confirmed the bot identity yet. Run Test Connection once.
zh_hans: Osaurus 尚未确认机器人身份。请运行一次测试连接。
zh_hant: Osaurus 尚未確認機器人身份。請運行一次測試連線。

source: Osaurus ignores the bot's own messages.
zh_hans: Osaurus 忽略机器人自身的消息。
zh_hant: Osaurus 忽略機器人自身的訊息。

source: Osaurus polls Discord for new messages — no webhook or public URL is needed.
zh_hans: Osaurus 轮询 Discord 以获取新消息 — 不需要 webhook 或公共 URL。
zh_hant: Osaurus 輪詢 Discord 以獲取新訊息 — 不需要 webhook 或公共 URL。

source: Osaurus polls Telegram for new messages — no webhook or public URL is needed.
zh_hans: Osaurus 轮询 Telegram 以获取新消息 — 不需要 webhook 或公共 URL。
zh_hant: Osaurus 輪詢 Telegram 以獲取新訊息 — 不需要 webhook 或公共 URL。

source: Osaurus Premium
zh_hans: Osaurus 高级版
zh_hant: Osaurus 進階版

source: Osaurus Router is off.
zh_hans: Osaurus 路由器已关闭。
zh_hant: Osaurus 路由器已關閉。

source: Outbound limited to the provisioning agent's allowed domains
zh_hans: 出站仅限于配置智能体允许的域名
zh_hant: 出站僅限於配置代理允許的網域

source: Output tokens
zh_hans: 输出 Token
zh_hant: 輸出詞元

source: Over limit
zh_hans: 超出限制
zh_hant: 超出限制

source: Paid: $5 per 1,000 queries (card required)
zh_hans: 付费：每 1,000 次查询 $5（需信用卡）
zh_hant: 付費：每 1,000 次查詢 $5（需信用卡）

source: Paid: $5 per 1,000 searches
zh_hans: 付费：每 1,000 次搜索 $5
zh_hant: 付費：每 1,000 次搜尋 $5

source: Paid: $25 credit minimum
zh_hans: 付费：最低 $25 充值
zh_hant: 付費：最低 $25 充值

source: Paid: pay-per-use (billed separately from a Kagi subscription)
zh_hans: 付费：按用量计费（与 Kagi 订阅分开结算）
zh_hant: 付費：按用量計費（與 Kagi 訂閱分開結算）

source: Parallel API key
zh_hans: Parallel API 密钥
zh_hant: Parallel API 金鑰

source: Paste both values below.
zh_hans: 在下方粘贴两个值。
zh_hant: 在下方貼上兩個值。

source: Paste here
zh_hans: 在此粘贴
zh_hant: 在此貼上

source: Paste it below.
zh_hans: 在下方粘贴。
zh_hant: 在下方貼上。

source: Paste the bot token
zh_hans: 粘贴机器人令牌
zh_hant: 粘貼機器人令牌

source: Paste the bot token above and press “Load from Discord” in the Access section, then an invite URL appears here. (You can also use OAuth2 → URL Generator in the Developer Portal with the bot scope.)
zh_hans: 在上方粘贴机器人令牌并按访问部分的“从 Discord 加载”，然后邀请链接会出现在此处。（你也可以在开发者门户中使用 OAuth2 → URL 生成器，选择 bot 范围。）
zh_hant: 在上方粘貼機器人令牌並按訪問部分的“從 Discord 載入”，然後邀請鏈接會出現在此處。（您也可以在開發者入口網站中使用 OAuth2 → URL 產生器，選擇 bot 範圍。）

source: Paste your API key
zh_hans: 粘贴你的 API 密钥
zh_hant: 貼上你的 API 金鑰

source: Paste your API key — it's verified with a real search
zh_hans: 粘贴你的 API 密钥 — 将通过真实搜索进行验证
zh_hant: 貼上您的 API 金鑰 — 將透過真實搜尋進行驗證

source: Paste your bot token
zh_hans: 粘贴你的机器人令牌
zh_hant: 貼上您的機器人令牌

source: Paste your signing secret
zh_hans: 粘贴你的签名密钥
zh_hant: 貼上您的簽章金鑰

source: Pending after Save
zh_hans: 保存后生效
zh_hant: 儲存後生效

source: Pending updates: %lld
zh_hans: 待处理更新：%lld
zh_hant: 待處理更新：%lld

source: Per-Agent Environments
zh_hans: 按智能体的环境
zh_hant: 每個代理的環境

source: Per-agent rootfs template
zh_hans: 每个智能体的根文件系统模板
zh_hant: 每個代理的根檔案系統範本

source: Per-agent warm restart rootfs
zh_hans: 每个智能体的热重启根文件系统
zh_hant: 每個代理的熱重啟根檔案系統

source: per-app %@ -> %@
zh_hans: 按应用 %1$@ → %2$@
zh_hant: 依應用程式 %1$@ → %2$@

source: Per-app contribution
zh_hans: 按应用的影响
zh_hant: 依應用程式的影響

source: Per-category Provider Order
zh_hans: 分类提供商顺序
zh_hant: 分類提供商順序

source: Permanently delete every table and row this agent has stored. The agent itself is kept.
zh_hans: 永久删除此智能体存储的每个表和行。智能体本身保留。
zh_hant: 永久刪除此代理儲存的每個表和行。代理本身保留。

# Permission behavior for %@: %@
source: Permission behavior for %1$@: %2$@
zh_hans: %1$@ 的权限行为：%2$@
zh_hant: %1$@ 的權限行爲：%2$@

source: Permission Doctor
zh_hans: 权限诊断
zh_hant: 權限診斷

source: Permission Doctor and autonomy gate inspector.
zh_hans: 权限诊断和自主权限门控检查器。
zh_hant: 權限診斷和自主權限門控檢查器。

source: Permit @channel, @here, and <!subteam> mentions in outgoing Slack messages. Leave off unless the workspace expects that behavior.
zh_hans: 允许在传出的 Slack 消息中提及 @channel、@here 和 <!subteam>。除非工作区期望此行为，否则请保持关闭。
zh_hant: 允許在傳出的 Slack 訊息中提及 @channel、@here 和 <!subteam>。除非工作區期望此行為，否則請保持關閉。

source: Permit send and reply actions only for write-allowlisted rooms. Tool calls still require confirmation.
zh_hans: 仅允许对写入允许列表的房间执行发送和回复操作。工具调用仍需确认。
zh_hant: 僅允許對寫入允許清單的房間執行傳送和回覆操作。工具呼叫仍需確認。

source: Persist content-addressed prompt checkpoints on SSD. Works with paged RAM cache off and restores the longest matching prefix after restart; turn off to disable disk reuse.
zh_hans: 在 SSD 上持久化内容寻址的提示检查点。即使分页 RAM 缓存关闭也能工作，重启后恢复最长匹配前缀；关闭以禁用磁盘复用。
zh_hant: 在 SSD 上持久化內容定址的提示檢查點。與分頁 RAM 快取關閉時配合工作，重啟後恢復最長匹配前綴；關閉以停用磁碟複用。

source: Personal Organizer
zh_hans: 个人事务助理
zh_hant: 個人組織者

source: Pick a table to see what's inside.
zh_hans: 选择一个表查看内容。
zh_hant: 選擇一個表查看內容。

source: Pick which provider answers first for each kind of search. The rest follow your main list order, with built-in sources as backup.
zh_hans: 选择每种搜索的首选提供商。其余按你的主列表顺序排列，内置源作为备份。
zh_hant: 選擇每種搜尋的首選提供者。其餘按你的主清單順序排列，內置源作爲備份。

source: Pick which provider answers first for each kind of search. The rest follow your main list order, with free sources as backup.
zh_hans: 选择每种搜索类型的首选提供商。其余按你的主列表顺序排列，免费来源作为备选。
zh_hant: 選擇每種搜尋類型的首選供應商。其餘依您的主列表順序排列，免費來源作為備選。

source: Pick which tools this agent can use
zh_hans: 选择此智能体可以使用哪些工具
zh_hant: 選擇此代理可以使用哪些工具

source: Pick which tools this agent can use. Skills come from the shared library and are always available.
zh_hans: 选择此智能体可以使用哪些工具。技能来自共享库，始终可用。
zh_hant: 選擇此代理可以使用哪些工具。技能來自共享函式庫，始終可用。

source: Pin to Overview
zh_hans: 固定到概览
zh_hant: 固定到概覽

source: Pinned views appear as cards on the Database Overview.
zh_hans: 固定视图以卡片形式显示在数据库概览上。
zh_hant: 固定視圖以卡片形式顯示在資料庫概覽上。

# Plugin %@, %lld tools
source: Plugin %1$@, %2$lld tools
zh_hans: 插件 %@，%lld 个工具
zh_hant: 插件 %@，%lld 個工具

source: Polling is not running. Add a bot token, readable channels, and authorized sender IDs to start it.
zh_hans: 轮询未运行。添加机器人令牌、可读频道和授权发送者 ID 以启动它。
zh_hant: 輪詢未運行。新增機器人令牌、可讀頻道和授權傳送者 ID 以啓動它。

source: Port
zh_hans: 端口
zh_hant: 連接埠

source: Port & Network
zh_hans: 端口与网络
zh_hant: 連接埠與網路

source: Post sanitized agent responses back to Discord when write gates allow it.
zh_hans: 当写入门控允许时，将清理后的智能体响应发布回 Discord。
zh_hant: 當寫入門允許時，將清理後的智慧體回應發佈回 Discord。

source: Post the selected agent's sanitized response in the same thread. Slack and global writes plus the write allowlist still apply.
zh_hans: 在同一讨论串中发布所选智能体清理后的响应。Slack 与全局写入设置以及写入允许列表仍然适用。
zh_hant: 在同一討論串中發佈所選智慧體的清理回應。Slack 和全域寫入以及寫入允許清單仍然適用。

source: Power
zh_hans: 电源
zh_hant: 電源

source: Preload the selected local model and prefill your chat context so the first response starts faster. The model selector shows yellow while warming and green when ready.
zh_hans: 预加载所选本地模型并预填充聊天上下文，使首次响应更快开始。模型选择器在预热时显示黄色，就绪时显示绿色。
zh_hant: 預先載入所選本地模型並預先填入聊天上下文，使首次回應更快開始。模型選擇器在預熱時顯示黃色，就緒時顯示綠色。

source: Premium
zh_hans: 高级版
zh_hant: 進階版

source: Premium ad-free search (paid API).
zh_hans: 高级无广告搜索（付费 API）。
zh_hant: 高級無廣告搜尋（付費 API）。

source: Premium search
zh_hans: 高级搜索
zh_hant: 進階搜尋

source: Premium Search
zh_hans: 高级搜索
zh_hant: 進階搜尋

source: Premium search is paused - add credits to resume.
zh_hans: 高级搜索已暂停 — 添加积分以恢复。
zh_hant: 進階搜尋已暫停 — 新增積分以邊原。

source: Premium search ran out of credits and is quietly using the built-in sources. Add credits to resume - nothing else to reset.
zh_hans: 高级搜索积分已用完，正在静默使用内置源。添加积分以恢复 — 无需其他重置。
zh_hant: 進階搜尋積分已用完，正在靜默使用內置源。新增積分以邊原 — 無需其他重設。

source: Premium search runs the `web_search` tool through Osaurus - better results with zero setup. Search credits cover requests first; after that, requests bill this wallet. If credits run out, search continues on the built-in sources automatically.
zh_hans: 高级搜索通过 Osaurus 运行 `web_search` 工具 — 零设置即可获得更好的结果。请求费用优先由搜索积分抵扣；积分用完后，请求将从此钱包计费。若积分耗尽，搜索会自动继续使用内置源。
zh_hant: 進階搜尋通過 Osaurus 運行 `web_search` 工具 — 零設定即可獲得更好的結果。搜尋積分優先覆蓋請求；之後，請求從此錢包計費。積分用完後，搜尋自動切換到內置源。

source: Preparing inspection...
zh_hans: 正在准备检查…
zh_hant: 正在準備檢查…

source: Press key
zh_hans: 按键
zh_hant: 按鍵

source: Prevent idle system sleep while agent sessions are running or queued, so long tasks can finish. The display may still sleep, and closing a MacBook lid or choosing Sleep always takes priority.
zh_hans: 在智能体会话运行或排队时防止系统空闲休眠，以便长任务可以完成。显示器仍可能休眠，合上 MacBook 盖子或选择休眠始终优先。
zh_hant: 在智能體會話運行或排隊時防止系統空閒休眠，以便長任務可以完成。顯示器仍可能休眠，合上 MacBook 蓋子或選擇休眠始終優先。

source: Preview a proposed app action against the current policy without running it.
zh_hans: 在不实际执行的前提下，用当前策略预览一次拟进行的应用操作。
zh_hant: 在不實際執行的前提下，以目前原則預覽一次擬進行的應用程式操作。

source: Preview app: %@. Allowed apps: %@.
zh_hans: 预览应用：%1$@。允许的应用：%2$@。
zh_hant: 預覽的應用程式：%1$@。允許的應用程式：%2$@。

source: Preview ceiling
zh_hans: 预览上限
zh_hant: 預覽上限

source: Preview shows the first %lld rows.
zh_hans: 预览显示前 %lld 行。
zh_hant: 預覽顯示前 %lld 行。

source: Preview shows the first row.
zh_hans: 预览显示第一行。
zh_hant: 預覽顯示第一行。

source: Previous session
zh_hans: 上一个会话
zh_hant: 上一個會話

source: Privacy & Security
zh_hans: 隐私与安全
zh_hant: 隱私與安全

source: Privacy Filter
zh_hans: 隐私过滤器
zh_hant: 隱私過濾器

# privacy.category.url
source: URL
zh_hans: 网址
zh_hant: 網址

source: Probe completed initialize/listTools and found %lld tools.
zh_hans: 探测完成 initialize/listTools，发现 %lld 个工具。
zh_hant: 探測完成 initialize/listTools，發現 %lld 個工具。

source: Probe completed initialize/listTools and found 1 tool.
zh_hans: 探测完成 initialize/listTools，发现 1 个工具。
zh_hant: 探測完成 initialize/listTools，發現 1 個工具。

source: Probe Failed
zh_hans: 探测失败
zh_hant: 探測失敗

source: Probe Passed
zh_hans: 探测通过
zh_hant: 探測通過

source: Project
zh_hans: 项目
zh_hant: 項目

source: Prompt Cache
zh_hans: 提示缓存
zh_hant: 提示快取

source: Providers are tried in order; if one fails, the next takes over. Run a test search below to confirm everything works.
zh_hans: 提供商按顺序依次尝试；如果一个失败，下一个将接管。在下方运行测试搜索以确认一切正常。
zh_hant: 供應商依順序依次嘗試；如果一個失敗，下一個將接管。在下方執行測試搜尋以確認一切正常。
